АлогистикТест2/src/Documents/алк_ПеремещениеЛесопродукции/алк_ПеремещениеЛесопродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПеремещениеЛесопродукции</name>
  <comment>Перемещение лесопродукции (круглые ЛМ и пиломатериала штучно) по различным направлениям с указанием участка отправителя</comment>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.алк_ВидыДокументовПеремещенияЛесопродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускатьМинус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_ВидыДокументовПеремещенияЛесопродукции/алк_ВидыДокументовПеремещенияЛесопродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДокументовПеремещенияЛесопродукции</name>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВУтилизацию</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСобственныеНужды</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПереупаковкуСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦЛП</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаЦЛП</name>
  </enumValues>
  <enumValues>
    <name>РеализацияНаСторону</name>
  </enumValues>
  <enumValues>
    <name>РеализацияНаДГ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ВозратС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ВозратС_ЦЛП</name>
  </enumValues>
  <enumValues>
    <name>ВозратС_МЛП</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/СтруктурныеЕдиницы/СтруктурныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктурныеЕдиницы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Ангар</name>
      <description>Ангар (сухие пиломатериалы)</description>
    </items>
    <items>
      <name>БуферСортировки</name>
      <description>Буфер сортировки</description>
    </items>
    <items>
      <name>ЖДтупик</name>
      <description>ЖД тупик</description>
    </items>
    <items>
      <name>ОсновноеПодразделение</name>
      <description>Основное подразделение</description>
    </items>
    <items>
      <name>ОсновнойСклад</name>
      <description>Основной склад</description>
    </items>
    <items>
      <name>СушильныйБуфер</name>
      <description>Сушильный буфер</description>
    </items>
    <items>
      <name>УчастокГТО</name>
      <description>Участок ГТО</description>
    </items>
    <items>
      <name>ХолоднаяЗона</name>
      <description>Холодная зона (пересортировка)</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипСтруктурнойЕдиницы</name>
    <type>
      <types>EnumRef.ТипыСтруктурныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрдерныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМОЛ</name>
    <comment>Подпись материально-ответственного лица</comment>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРознице</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценки</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОтходов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяОтходов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>алк_ТипСклада</name>
    <type>
      <types>EnumRef.алк_ТипСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>алк_УчетТоваровВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>алк_УчетТоваровВПорту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>алк_БалкПеревалка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_ПеремещениеЛесопродукции/ObjectModule.bsl
//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	// Процедура - обработчик события ОбработкаЗаполнения объекта.
	//
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		// Инициализация дополнительных свойств для проведения документа
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа
		Документы.алк_ПеремещениеЛесопродукции.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета 	
		РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ); 
		//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
		Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда 
			РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
			РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
		КонецЕсли;
		//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов --

		//Сергеева Г.О. Оборотный регистр ++  
		РфпСервер.ОтразитьОборотыПроизводства(ДополнительныеСвойства, Движения, Отказ);  			
		РфпСервер.ОтразитьОстаткиЛесопродукции(ДополнительныеСвойства, Движения, Отказ);
		//Сергеева Г.О. Оборотный регистр --
		
		БиржаЦЛП = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ);
		
		Если СтруктурнаяЕдиница = БиржаЦЛП ИЛИ СтруктурнаяЕдиницаПолучатель = БиржаЦЛП Тогда
			
			// Отражение по "Последовательностям"
			РфпСервер.ОтразитьДокументыПоследовательностиБиржа(ДополнительныеСвойства, Движения, Отказ);
			
		КонецЕсли; 
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		
		Если Дата > '20231001075959' Тогда  // 01.10.23 - провели инвентаризацию и перевели на новый регистр  
			
			РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.Проведение);
			
		Иначе // старый контроль
			
			// Контроль (временно)
			
			//ОтказПоКонтролю = Контроль(РежимПроведения, ДополнительныеСвойства, ВидДокумента);
			ОтказПоКонтролю = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимПроведения, ДополнительныеСвойства, "алк_ЗапасыОрганизации");
			
			Если ОтказПоКонтролю И Не ПропускатьМинус Тогда
				
				Отказ = Истина;
				
			КонецЕсли; 	
			
		КонецЕсли;   	
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();  
		
		
		
	КонецПроцедуры // ОбработкаПроведения()
	
	#КонецОбласти
	
	
	#Область ПроцедурыЗаполненияДокумента
	
	// Обработчик заполнения документа по структуре
	//
	// Параметры:
	//
	Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
		
		Если ДанныеЗаполнения.Свойство("Основание") Тогда
			
		КонецЕсли;
		
		//Если ДанныеЗаполнения.Свойство("Заказ") Тогда
		//	Заказ = ДанныеЗаполнения.Заказ;	
		//КонецЕсли; 
		//
		//Если ДанныеЗаполнения.Свойство("ВидТранспортировки") Тогда
		//	ВидТранспортировки = ДанныеЗаполнения.ВидТранспортировки;	
		//КонецЕсли;	
		
	КонецПроцедуры
	
	
	
	#КонецОбласти


Процедура Конец()	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда
		
		Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
		КонецЕсли; 
		
	Иначе
		
		СтратегияЗаполнения = Новый Соответствие;
		СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
		//СтратегияЗаполнения[Тип("ДокументСсылка.алк_ПеремещениеЗапасов")] = "ЗаполнитьПоПеремещениеЗапасов";
		//
		//Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.алк_ПеремещениеЗапасов")
		//	И ДанныеЗаполнения.Ссылка.ВидОперации <> Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ВозвратНаПроизводство Тогда
		//	
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст = "Основанием может являться документ с видом операции ""Возврат на производство""!";
		//	Сообщение.Сообщить();
		//	
		//	Возврат;
		//	
		//КонецЕсли; 
		
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);			
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;

	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства); 
		
	Если Дата > '20231001075959' Тогда  // 01.10.23 - провели инвентаризацию и перевели на новый регистр  
		
		РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.ОтменаПроведения);
		
	Иначе // старый контроль
		
		// Контроль (временно)
		
		//ОтказПоКонтролю = Контроль(РежимПроведения, ДополнительныеСвойства, ВидДокумента);
		ОтказПоКонтролю = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимЗаписиДокумента.ОтменаПроведения, ДополнительныеСвойства, "алк_ЗапасыОрганизации");
		
		Если ОтказПоКонтролю И Не ПропускатьМинус Тогда
			
			Отказ = Истина;
			
		КонецЕсли; 	
		
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();  

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Возврат;
	КонецЕсли; 
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	алк_ОстаткиЗапасов.Характеристика,
			|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
			|	алк_ОстаткиЗапасов.Штабель
			|ИЗ
			|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
			|ГДЕ
			|	алк_ОстаткиЗапасов.Регистратор = &Регистратор
			|	И НЕ алк_ОстаткиЗапасов.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	алк_ОстаткиЗапасов.Характеристика,
			|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
			|	алк_ОстаткиЗапасов.Штабель";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);	
	
		ДополнительныеСвойства.Вставить("ТЧХарактеристикДоЗаписи",Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
	Если ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаЦПШ Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЯчейкаПолучатель) И СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000001") Тогда 
		Сообщить("Ошибка! Заполните ячейку (штабель) получателя.");
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры
